#+Title: Literate Programming for evaluating the Results of my Bachelors Thesis
#+property: header-args exports:both :tangle yes
* Loading the Optuna studies

#+begin_src python :results output :session
base_path = Path("/home/jakob/src/siamese_attention_thesis/studies/")
seeds = [str(i) for i in range(3)]
sampler_names = ["RandomSampler", "MOTPESampler", "NSGAIISampler", "TPESampler"]
multi = ["RandomSampler", "MOTPESampler", "NSGAIISampler"]
trial_number = "100"




all_test_objectives = []
all_random_objectives = []
studies = []
for seed in seeds:
    for sampler in sampler_names:
            study_name = seed + "_" + sampler + "_" + trial_number + ".pkl"
            study_path = base_path / study_name

            with open(study_path, 'rb') as handle:
                study = pickle.load(handle)
                trials = study.trials
                moo = True if sampler in multi else False
                objectives = get_objectives(trials, moo)
                if sampler == 'RandomSampler':
                    all_random_objectives += objectives


                all_test_objectives += objectives
                studies.append(my_study(seed, sampler, trials, objectives, study))



#+end_src

#+RESULTS:

#+caption:Calculating the reference point.
#+begin_src python :results output :session
all_hv = pygmo.hypervolume(all_test_objectives)
reference_point = all_hv.refpoint(1)
print(reference_point)
#+end_src

#+RESULTS:
: [2.048708e+00 4.585521e+06]

#+caption:Calculating the mean hypervolume.
#+begin_src python :results output :session
import  statistics
sum_hv = defaultdict(list)
for study in studies:
    study.non_dominated_sorting()
    study.calculate_hv_history(reference_point)
    study.calculate_hv(reference_point)
    # print(study.sampler_type)
    sum_hv[study.sampler_type].append(study.hv)
print("mean and sd:")
for i in sum_hv.keys():
    print(i)


    print(statistics.mean(sum_hv[i]))
    print(statistics.stdev(sum_hv[i]))
#+end_src

#+RESULTS:
#+begin_example
0_RandomSampler
6980621.448347205
0_MOTPESampler
6715925.995459827
0_NSGAIISampler
7209751.475471438
0_TPESampler
7173874.939273039
1_RandomSampler
7297932.478837449
1_MOTPESampler
7314503.472711459
1_NSGAIISampler
7127323.815278469
1_TPESampler
7518124.0695323795
2_RandomSampler
8128923.696416216
2_MOTPESampler
8092443.389980413
2_NSGAIISampler
8099360.2257946925
2_TPESampler
8120645.369683216
mean and sd:
RandomSampler
7469159.2078669565
592991.1110469484
MOTPESampler
7374290.9527172325
690203.550721464
NSGAIISampler
7478811.8388482
538988.6874486723
TPESampler
7604214.792829545
479220.48313186696
#+end_example

* Comparing whether there are significant differences in any of the results

#+begin_src python :results output :session
hypervolume_dict = defaultdict(list)
for study in studies:
    hypervolume_dict[study.sampler_type].append(study.hv)
kruskal = scipy.stats.kruskal(*[ hypervolume_dict[i] for i in hypervolume_dict.keys()])
print(kruskal)

#+end_src

#+RESULTS:
: KruskalResult(statistic=0.5384615384615401, pvalue=0.9103638772660103)
* MOO vs. Baseline
#+begin_src python :results output :session
pearson = 0
flops = 0
for trial in all_random_objectives:
    pearson += 1 - trial[0]
    flops += trial[1]

n = len(all_random_objectives)
print(f"expected random value:{pearson/n}, {flops/n}")

def mean_expected_value(name):
    pearson = 0
    flops = 0
    for study in  studies:
        if study.sampler_type == name:
            for trial in study.objective_list:
                pearson += 1 - trial[0]
                flops += trial[1]
    print(f"expected value {name} :{pearson/n}, {flops/n}")

mean_expected_value("MOTPESampler")

mean_expected_value("NSGAIISampler")
mean_expected_value("TPESampler")

#+end_src

#+RESULTS:
: expected random value:0.2262659508533086, 825373.28
: expected value MOTPESampler :0.26048771295928336, 632202.56
: expected value NSGAIISampler :0.2845265499762782, 618328.0
: expected value TPESampler :0.289977234575689, 934803.1466666666
** comparison of PPC values for different algorithms
#+begin_src python :results output :session
PCC = defaultdict(list)

for study in studies:
    for objective in study.objective_list:
        PCC[study.sampler_type].append(1-objective[0])
print(scipy.stats.kruskal(*[PCC[i] for i in PCC.keys()]))
print(scipy.stats.wilcoxon(PCC['TPESampler'],PCC['MOTPESampler'],alternative= 'greater'))
print(scipy.stats.wilcoxon(PCC['TPESampler'],PCC['NSGAIISampler'],alternative= 'greater'))
print(scipy.stats.wilcoxon(PCC['TPESampler'],PCC['RandomSampler'],alternative= 'greater'))
# print(wilcoxon)


#+end_src

#+RESULTS:
: KruskalResult(statistic=17.28292306111568, pvalue=0.0006180880838953429)
: WilcoxonResult(statistic=25768.0, pvalue=0.006979141631940174)
: WilcoxonResult(statistic=22616.0, pvalue=0.4095457914123076)
: WilcoxonResult(statistic=27715.0, pvalue=8.073462455103256e-05)
** comparison of Flop values for different algorithms

#+begin_src python :results output :session
Flops = defaultdict(list)

for study in studies:
    for objective in study.objective_list:
        Flops[study.sampler_type].append(objective[1])
print(scipy.stats.kruskal(*[Flops[i] for i in Flops.keys()]))
print(scipy.stats.wilcoxon(Flops['TPESampler'],Flops['MOTPESampler'],alternative= 'greater'))
print(scipy.stats.wilcoxon(Flops['TPESampler'],Flops['NSGAIISampler'],alternative= 'greater'))
print(scipy.stats.wilcoxon(Flops['TPESampler'],Flops['RandomSampler'],alternative= 'greater'))
# print(wilcoxon)


#+end_src

#+RESULTS:
: KruskalResult(statistic=23.16018520763927, pvalue=3.7394344531104304e-05)
: WilcoxonResult(statistic=22934.0, pvalue=0.000150702815109139)
: WilcoxonResult(statistic=22954.0, pvalue=0.0001418964526325574)
: WilcoxonResult(statistic=18462.0, pvalue=0.40577814047369665)

* Spearmans Rank to see whether Flops and PCC are correlated in my data

#+begin_src python :results output :session
pearson = [1 - i[0] for i in all_random_objectives]
flops = [i[1] for i in all_random_objectives]

spearman = scipy.stats.spearmanr(a=flops, b=pearson, alternative = 'greater')

print(spearman)
#+end_src

#+RESULTS:
: SpearmanrResult(correlation=0.11468869842293508, pvalue=0.023587413139184096)
